music_app/app/models/user.rb

  def reset_session_token!
    self.session_token = SecureRandom.urlsafe_base64
    self.save!
---
UPDATE "users" SET "session_token" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["session_token", "D8K-iVjDXYaTuGHfJnjV_g"], ["password_digest", "t"], ["updated_at", "2018-09-13 22:23:53.120911"], ["id", 22]]