music_app/app/controllers/bands_controller.rb

  def create
    @band = Band.new(user_params)
    if @band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "blink 182"], ["created_at", "2018-09-13 23:44:33.185088"], ["updated_at", "2018-09-13 23:44:33.185088"]]